/*
 Светодиоды изготавливаются из полупроводниковых материалов.
 Ниже приведены доступные цвета с падением напряжения на диоде.
 ====================================
 Инфракрасный     | ΔU < 1,90
 ------------------------------------
 Красный          | 1,63 < ΔU < 2,03
 ------------------------------------
 Оранжевый        | 2,03 < ΔU < 2,10
 ------------------------------------
 Жёлтый           | 2,10 < ΔU < 2,18
 ------------------------------------
 Зелёный          | 1,90 < ΔU < 4,00
 ------------------------------------
 Сине-зелёный     | 2,48 < ΔU < 3,70
 ------------------------------------
 Синий            | 2,48 < ΔU < 3,70
 ------------------------------------
 Фиолетовый       | 2,76 < ΔU < 4,00
 ------------------------------------
 Пурпурный        | 2,48 < ΔU < 3,70
 ------------------------------------
 Ультрафиолетовый | 3,10 < ΔU < 4,40
 ------------------------------------
 Белый            | ΔU ≈ 3,50
 ====================================
*/
/*
 Для расчета резистора, ограничивающего ток светодиода,
 используется формула: R = (V - Vl) / Il
*/

#ifndef SINGLE_LED_H
#define SINGLE_LED_H

#include <stdint.h>
#include <stddef.h>

namespace wokwi
{
    class single_led
    {
    public:
        explicit single_led(uint8_t pin);
        single_led(const single_led&) = delete;
        single_led(single_led&&) = delete;
        ~single_led() = default;

        single_led& operator=(const single_led&) = delete;
        single_led& operator=(single_led&&) = delete;
        
        void power_on() const;
        void power_off() const;

    private:
        uint8_t _pin{};
    };
}

#endif // !SINGLE_LED_H